ZhuYanzhen1/miniFOC/program/CH32V203xx.svd
      </registers>
    </peripheral>
	<peripheral>
		<name>USBHD</name>
		<description>USB register</description>
		<groupName>USBHD</groupName>
		<baseAddress>0x40023400</baseAddress>
		<addressBlock>
			<offset>0x00</offset>
			<size>0x400</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>USBHSWakeup</name>
			<description>USBHSWakeup</description>
			<value>84</value>
		</interrupt>
		<interrupt>
		<name>USBHS</name>
		<description>USBHS</description>
			<value>85</value>
		</interrupt>
		<registers>
			<register>
				<name>USB_CTRL</name>
				<description>USB base control</description>
				<addressOffset>0x00</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
        <resetValue>0x06</resetValue>
				<fields>
					<field>
						<name>RB_UC_DMA_EN</name>
						<description>DMA enable and DMA interrupt enable for USB</description>
						<bitRange>[0:0]</bitRange>		
					</field>
					<field>
						<name>RB_UC_CLR_ALL</name>
						<description>force clear FIFO and count of USB</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UC_RESET_SIE</name>
						<description>force reset USB SIE, need software clear</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UC_INT_BUSY</name>
						<description>enable automatic responding busy for device mode or automatic pause for host mode during interrupt flag UIF_TRANSFER valid</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UC_DEV_PU_EN</name>
						<description>USB device enable and internal pullup resistance enable</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UC_SPEED_TYPE</name>
						<description>enable USB low speed: 00=full speed, 01=high speed, 10 =low speed</description>
						<bitRange>[6:5]</bitRange>
					</field>
					<field>
						<name>RB_UC_HOST_MODE</name>
						<description>enable USB host mode: 0=device mode, 1=host mode</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>UHOST_CTRL</name>
				<description>USB HOST control</description>
				<addressOffset>0x01</addressOffset>
				<size>0x08</size>
				<fields>
					<field>
						<name>bUH_TX_BUS_RESET</name>
						<description>USB host bus reset status</description>
						<bitRange>[0:0]</bitRange>
						<access>read-write</access>
					</field>
					<field>
						<name>bUH_TX_BUS_SUSPEND</name>
						<description>the host sends  hang sigal</description>
						<bitRange>[1:1]</bitRange>
						<access>read-write</access>
					</field>
					<field>
						<name>bUH_TX_BUS_RESUME</name>
						<description>host wake up device</description>
						<bitRange>[2:2]</bitRange>
						<access>read-write</access>
					</field>
					<field>
						<name>bUH_REMOTE_WKUP</name>
						<description>the remoke wake-up</description>
						<bitRange>[3:3]</bitRange>
						<access>read-write</access>
					</field>
					<field>
						<name>bUH_PHY_SUSPENDM</name>
						<description>USB-PHY thesuspended state the internal USB-PLL is turned off</description>
						<bitRange>[4:4]</bitRange>
						<access>read-write</access>
					</field>
					<field>
						<name>bUH_SOF_FREE</name>
						<description>the bus is idle </description>
						<bitRange>[6:6]</bitRange>
						<access>read-only</access>
					</field>
					<field>
						<name>bUH_SOF_EN</name>
						<description>automatically generate the SOF packet enabling control bit </description>
						<bitRange>[7:7]</bitRange>
						<access>read-write</access>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_INT_EN</name>
				<description>USB interrupt enable</description>
				<addressOffset>0x02</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UIE_BUS_RST__RB_UIE_DETECT</name>
						<description>enable interrupt for USB bus reset event for USB device mode;enable interrupt for USB device detected event for USB host mode</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UIE_TRANSFER</name>
						<description>enable interrupt for USB transfer completion</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UIE_SUSPEND</name>
						<description>enable interrupt for USB suspend or resume event</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UIE_SOF_ACT</name>
						<description>indicate host SOF timer action status for USB host</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UIE_FIFO_OV</name>
						<description>enable interrupt for FIFO overflow</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UIE_SETUP_ACT</name>
						<description>indicate host SETUP timer action status for USB host</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RB_UIE_ISO_ACT</name>
						<description>enable interrupt for NAK responded for USB device mode</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UIE_DEV_NAK</name>
						<description>enable interrupt for NAK responded for USB device mode</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_DEV_AD</name>
				<description>USB device address</description>
				<addressOffset>0x03</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>MASK_USB_ADDR</name>
						<description>bit mask for USB device address</description>
						<bitRange>[6:0]</bitRange>
					</field>
					<field>
						<name>RB_UDA_GP_BIT</name>
						<description>general purpose bit</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_FRAME_NO</name>
				<description>USB_FRAME_NO</description>
				<addressOffset>0x04</addressOffset>
				<size>0x10</size>
				<access>read-only</access>
			<resetValue>0x0000</resetValue>
				<fields>
					<field>
						<name>USB_FRAME_NO</name>
						<description>USB_FRAME_NO</description>
						<bitRange>[15:0]</bitRange>
					</field>
	
				</fields>
			</register>
			<register>
				<name>USB_USB_SUSPEND</name>
				<description>indicate USB suspend status</description>
				<addressOffset>0x06</addressOffset>
				<size>0x08</size>
				<access>read-write</access>
			<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>USB_SYS_MOD</name>
						<description>USB_SYS_MOD</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>USB_WAKEUP</name>
						<description>remote resume</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USB_LINESTATE</name>
						<description>USB_LINESTATE</description>
						<bitRange>[5:4]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_SPEED_TYPE</name>
				<description>USB_SPEED_TYPE</description>
				<addressOffset>0x08</addressOffset>
				<size>0x08</size>
				<access>read-only</access>
			<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>USB_SPEED_TYPE</name>
						<description>USB_SPEED_TYPE</description>
						<bitRange>[1:0]</bitRange>
					</field>
					</fields>
			</register>
			
			<register>
				<name>USB_MIS_ST</name>
				<description>USB miscellaneous status</description>
				<addressOffset>0x09</addressOffset>
				<size>0x08</size>
				<access>read-only</access>
				<resetValue>0x00</resetValue>
				<fields>
					<field>
						<name>RB_UMS_SPLIT_CAN</name>
						<description>RO, indicate device attached status on USB host</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UMS_ATTACH</name>
						<description>RO, indicate UDM level saved at device attached to USB host</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SUSPEND</name>
						<description>RO, indicate USB suspend status</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UMS_BUS_RESET</name>
						<description>RO, indicate USB bus reset status</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UMS_R_FIFO_RDY</name>
						<description>RO, indicate USB receiving FIFO ready status (not empty)</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SIE_FREE</name>
						<description>RO, indicate USB SIE free status</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SOF_ACT</name>
						<description>RO, indicate host SOF timer action status for USB host</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SOF_PRES</name>
						<description>RO, indicate host SOF timer presage status</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_INT_FG</name>
				<description>USB interrupt flag</description>
				<addressOffset>0x0A</addressOffset>
				<size>0x08</size>
				
